package de.telran.practice001;

import org.w3c.dom.ls.LSOutput;

public class getDays {
//    Создайте перечисление (enum) для представления дней недели.
//    Напишите метод, который принимает на вход день недели и
//    возвращает следующий за ним день.


    public static void main(String[] args) {
        System.out.println(DayOfWeek());
    }


}



